# LEET CODE
## Problem-1907: Count Salary Categories
Class: Medium

Source: https://leetcode.com/problems/count-salary-categories

## Description
Table: Accounts
| Column Name | Type |
|-------------|------|
| account_id  | int  |
| income      | int  |

- account_id is the primary key (column with unique values) for this table.
- Each row contains information about the monthly income for one bank account.
 
## To Do
Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:
- "Low Salary": All the salaries strictly less than $20000.
- "Average Salary": All the salaries in the inclusive range [$20000, $50000].
- "High Salary": All the salaries strictly greater than $50000.

The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.

The result format is in the following example.

## Example

Input: 

Accounts table:
| account_id | income |
|------------|--------|
| 3          | 108939 |
| 2          | 12747  |
| 8          | 87709  |
| 6          | 91796  |

Output: 
| category       | accounts_count |
|----------------|----------------|
| Low Salary     | 1              |
| Average Salary | 0              |
| High Salary    | 3              |

Explanation: 
- Low Salary: Account 2.
- Average Salary: No accounts.
- High Salary: Accounts 3, 6, and 8.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
Accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

Accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

## Task

In [4]:
# Define the SQL query
query = """
SELECT
    'Low Salary' AS category,
    COUNT(*) AS accounts_count
FROM Accounts
WHERE income < 20000

UNION

SELECT
    'Average Salary' AS category,
    COUNT(*) AS accounts_count
FROM Accounts
WHERE income >= 20000 AND income <= 50000

UNION

SELECT
    'High Salary' AS category,
    COUNT(*) AS accounts_count
FROM Accounts
WHERE income > 50000;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Accounts':Accounts})

# Display the result dataframe
display(result)

         category  accounts_count
0  Average Salary               0
1     High Salary               3
2      Low Salary               1